// дай умову задачі з циклом по js, щоб вона не була вирішена, я сам хочу її вирішити

//Створіть цикл for в JavaScript, який перебирає числа від 1 до 100.
//У тілі циклу виводьте на консоль лише ті числа, які діляться на 3 і на 5 одночасно.

// function getNumbers(min, max, number) {
//   for (let i = min; i <= max; i++) {
//     if (number % 3 === 0 && number % 5 === 0) {
//       console.log(number);
//     }
//   }
//   return number;
// }

// console.log(getNumbers(1, 100));

// function getNumbers(min, max) {
//   for (let i = min; i <= max; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log(i);
//     }
//   }
// }

// getNumbers(1, 100);

// Напишіть цикл, який буде виводити на екран всі парні числа від 0 до заданого числа (включно), але пропускатиме числа, кратні 3.
// Вхідні параметри:
// - number: число, до якого потрібно вивести парні числа

// Приклад виклику функції:
// printEvenNumbers(10);

// Очікуваний результат:
// 2
// 4
// 8
// 10

// function printEvenNumbers(min, max) {
//   for (let i = min; i <= max; i++) {
//     if (i % 2 === 0) {
//       console.log(i);
//     }
//   }
// }

// printEvenNumbers(1, 10);

// Уявіть, що у вас є масив чисел. Ваше завдання - написати цикл, який перебирає всі числа у масиві та виводить лише парні числа.
// Умови:
// - Не використовуйте вбудовані методи, такі як `filter` або `forEach`.
// - Використовуйте цикл `for` для ітерації по масиву.

// У вас є масив імен студентів. Напишіть цикл, який проходиться по кожному елементу масиву і
// виводить в консоль повідомлення, що містить ім'я студента та його порядковий номер.

// function getNames(students) {
//   let emptyArray = [];
//   for (let i = 0; i < students.length; i++) {
//     emptyArray.push(students[i]);
//   }
// }
// console.log(getNames('john', 'maria'));
